app/views/bookings/index.html.erb

SELECT "paintings".* FROM "paintings" WHERE "paintings"."user_id" = $1  [["user_id", 181]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."painting_id" = $1  [["painting_id", 181]]
---

    this.addEventListener("click", (e) => {
      // INIT
      const className = e.target.className;
      const whereToShow = document.querySelector(".show-res");

      // INJECT HTML
      if(className == "bookings" && document.querySelector(".allbookings-div") === null) {
        addClassSelected(e.target);
        whereToShow.innerHTML = "";
        // SHOW ALL BOOKINGS
        whereToShow.insertAdjacentHTML("beforeend", `
        <% if @bookings != [] %>
          <% @bookings.each do |booking| %>
            <div class='card-product allbookings-div'>
              <%= cl_image_tag booking.painting.photo, height: 300, width: 400, crop: :fill %>
              <div class='card-container'>
                <div class='card-product-infos'>
                  <h2>
                    <%= booking.painting.title %> by <%= current_user.first_name %> <%= current_user.last_name %> -
                    <span class='price'><%= booking.painting.price %>/per day</span>
                  </h2>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 181], ["LIMIT", 1]]
---
        // SHOW ALL PAINTINGS
        whereToShow.insertAdjacentHTML("beforeend", `
        <% if @paintings != [] %>
          <% @paintings.each do |painting|%>
              <div class='card-product allpaintings-div'>
                <%= cl_image_tag painting.photo, height: 300, width: 400, crop: :fill %>
                <div class='card-container'>
                  <div class='card-product-infos'>
                    <h2>
                      <%= painting.title %> -
                      <span class='price'><%= painting.price %>/per day</span>
                    </h2>
                    <p><%= painting.description %></p>
                    <!-- IF BOOKING EXIST THEN SHOW BOOKING DATE -->
                    <% unless painting.bookings == [] %>
                    <p>Booking date : <%= painting.bookings.first.start_date %> - <%= painting.bookings.first.end_date %> </p>
                    <% end %>
                  </div>
                  <!-- IF BOOKING EXIST THEN SHOW USER -->
                  <% unless painting.bookings == [] %>
                    <div>
                      <p>rented by <%= painting.bookings.first.user.first_name %> <%= painting.bookings.first.user.last_name %></p>