app/views/bookings/index.html.erb

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", 180], ["LIMIT", 1]]
---
          <h2>
            <%= booking.painting.title %> by <%= current_user.first_name %> <%= current_user.last_name %> -