app/views/bookings/index.html.erb

  <h5>Painting name : <%= painting.title %></h5>
  <% painting.bookings.each do |booking| %>
---
SELECT "bookings".* FROM "bookings" ORDER BY "bookings"."created_at" DESC