app/controllers/bookings_controller.rb

  def index
    @booking = Booking.all
---
SELECT "bookings".* FROM "bookings" ORDER BY "bookings"."created_at" DESC

  def show
    @booking = Booking.find(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @user = current_user
    @booking = Booking.new
    authorize @booking
    @painting = Painting.find(params[:painting_id])
---
SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", 180], ["LIMIT", 1]]

  def create
    @user = current_user
    @booking = Booking.new(booking_params)
    @booking.user = @user
    @painting = Painting.find(params[:painting_id])
    @booking.painting = @painting
    authorize @booking
    if @booking.save
---
SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", 180], ["LIMIT", 1]]
INSERT INTO "bookings" ("start_date", "end_date", "location", "time", "user_id", "painting_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"