app/controllers/paintings_controller.rb

  def index
    if params[:tag].present?
      @paintings = policy_scope(Painting.tagged_with(params[:tag]))
    else
      @paintings = policy_scope(Painting).order(created_at: :desc)
---
SELECT "paintings".* FROM "paintings" ORDER BY "paintings"."created_at" DESC

  def set_painting
    @painting = Painting.find(params[:id])
---
SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", 180], ["LIMIT", 1]]