app/controllers/paintings_controller.rb

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", 180], ["LIMIT", 1]]
---
  def set_painting
    @painting = Painting.find(params[:id])